# SchemaName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..SchemaName Property
Schema Class See Also
---
The user-friendly name of the Schema.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string SchemaName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SchemaName As String
	Get
```

Visual C++
---
```text
public:
property String^ SchemaName {
	String^ get ();
}
```

# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace